import React from 'react'
// План
// - Розбити по компонентам розмітку
// - Додати слайс для постів
// - Додати слайс для юзера
// - Зробити функціонал додавання даних
// - Видалення поста
// - Редагування

export const Posts = () => {
	return (
		<div>
			{/* Форма додавання поста */}
			<form>
				<input />
				<input />
				<button>Add post</button>
			</form>

			{/* Поле для авторизації автора */}
			<div>
				<input />
				<button>Login</button>
			</div>
			{/* Пости з даними */}
			<ul>
				<li>Тут буде ваш текст</li>
				<li>Тут буде ваш текст</li>
				<li>Тут буде ваш текст</li>
			</ul>
		</div>
	)
}
